<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Identifier</key>
		<string>com.github.coreyramirezgomez.grahampugh.recipes.munki.ThinLincClient</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_CATEGORY</key>
			<string>Utilities</string>
            <key>MUNKI_DESCRIPTION</key>
			<string>A Linux remote desktop server built on open source technology.</string>
			<key>MUNKI_DEVELOPER</key>
			<string>Cendio AB</string>
			<key>DISPLAY_NAME</key>
			<string>ThinLinc Client</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>%NAME%</string>
			<key>NAME</key>
			<string>ThinLincClient</string>
			<key>pkginfo</key>
			<dict>
                <key>catalogs</key>
                <array>
                    <string>test</string>
                    <string>autopkg</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>%MUNKI_DESCRIPTION%</string>
                <key>developer</key>
                <string>%MUNKI_DEVELOPER%</string>
                <key>display_name</key>
                <string>%DISPLAY_NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.coreyramirezgomez.grahampugh.recipes.download.ThinLincClient</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
